examples/eulerian_module_examples/E4_doublet_flow/domainB/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 1 -1 0 0 0 0];

internalField   #include "internalFieldU";

boundaryField
{
    numericalBoundary
    {
        type            fixedValue;
        value           #include "boundaryFieldU";
        inletValue      #include "boundaryFieldU";
    }

}

// ************************************************************************* //
